# paragraphs.py

def get_paragraphs():
    """
    Returns a list of dictionaries containing input and true paragraphs.

    Returns:
        List[Dict[str, str]]: A list of dictionaries with 'input_paragraph' and 'true_paragraph'.
    """
    paragraphs = [
        {
            "input_paragraph": "මම දෙඩම් කනවා. අමාලි පාසැලට යනව. අපි කැම කනවා. කුරුල්ලෝ පියාඹනවා.",
            "true_paragraph": "මම දොඩම් කමි. අමාලි පාසැලට යයි. අපි කෑම කමු. කුරුල්ලෝ පියාඹති."
        },
        {
            "input_paragraph": "පූසා මීයා ලුහුබැඳ යනවා. මීයා වේගයෙන් දිව යනවා. ඌ සිදුරෙක් තුළ සැඟවීමට උත්සාහ කරනවා. පූසා වේගවත් වෙනවා. මීයා පූසාට හසු වෙනවා. ",
            "true_paragraph": "පූසා මීයා ලුහුබැඳ යයි. මීයා වේගයෙන් දිව යයි. ඌ සිදුරක් තුළ සැඟවීමට උත්සාහ කරයි. පූසා වේගවත් වෙයි. මීයා පූසාට හසු වෙයි."
        },
        {
            "input_paragraph": "ගුරුවරයා පඩම පැහැදිලි කරනවා. ශිෂ්‍යයෝ හොඳින් සවනි දෙනවා. ඔවුහු තම සටහන් පොත්වල සටහන් කර ගන්නවා. ගුරුවරයා ඔවුන්ගේ ප්‍රශ්නවලට උත්තර දෙනවා.",
            "true_paragraph": "ගුරුවරයා පාඩම පැහැදිලි කරයි. ශිෂ්‍යයෝ හොඳින් සවන් දෙති. ඔවුහු තම සටහන් පොත්වල සටහන් කර ගන්යි. ගුරුවරයා ඔවුන්ගේ ප්‍රශ්නවලට උත්තර දෙයි."
        },
        {
            "input_paragraph": "අමල් පොත කියවනවා. ඔහු හෙමිහිට පොත   පෙරලනවා. අමල් කියවන ගමන් හින වෙනවා. ඔහු පරිඡේදය අවසන කරනවා. ඔහු පොත වසා දමනවා.",
            "true_paragraph": "අමල් පොත කියවයි. ඔහු හෙමිහිට පොත පෙරලයි. අමල් කියවන ගමන් හිනා වෙයි. ඔහු පරිච්ඡේදය අවසාන කරයි. ඔහු පොත වසා දමයි."
        },
        {
            "input_paragraph": "කුරුල්ලෝ අහස හරහා පියාසර කරනවා. කුරුල්ලෝ පියපත් ගසනවා. කුරුල්ලෙක් ගසික් දකිනවා. ඌ අත්තක් මත වහනවා. කුරුල්ලෙක් ගීතයක් ගායනා කරනවා. ගස සෙමෙන් සෙලවෙනවා.",
            "true_paragraph": "කුරුල්ලෝ අහස හරහා පියාසර කරති. කුරුල්ලෝ පියාපත් ගසති. කුරුල්ලෙක් ගසක් දකියි. ඌ අත්තක් මත වහයි. කුරුල්ලෙක් ගීතයක් ගායනා කරයි. ගස සෙමෙන් සෙලවෙයි."
        }
    ]
    return paragraphs